AccumulationRegisters/ТоварыНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаКомиссии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссионера</Name>
					<Comment>Сумма по к-рой товар передан на комиссию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/Комиссия/Ext/Module.bsl
// Возвращает ТЗ партий, имеющихся на складе комиссии
//
Функция ОстаткиПартийНаКомиссии(Серия, Дата = Неопределено, Фирма = Неопределено, Склад = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("Серия", 	Серия);
	Запрос.УстановитьПараметр("Фирма", 	?(Фирма=Неопределено, ПараметрыСеанса.Фирма, Фирма));
	Запрос.УстановитьПараметр("Склад", 	Склад);
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Серия КАК Серия,
	               |	ТоварыНаКомиссии.Партия КАК Партия,
	               |	ТоварыНаКомиссии.Номенклатура КАК Номенклатура,
	               |	ТоварыНаКомиссии.Номенклатура.Наименование КАК ИмяНоменклатуры,
	               |	ТоварыНаКомиссии.КоличествоОстаток КАК Количество,
	               |	ТоварыНаКомиссии.СуммаОстаток КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ТоварыНаКомиссии.КоличествоОстаток = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТоварыНаКомиссии.СуммаОстаток / ТоварыНаКомиссии.КоличествоОстаток
	               |	КОНЕЦ КАК Цена,
	               |	ТоварыНаКомиссии.СуммаКомиссионераОстаток КАК СуммаКомиссионера
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаКомиссии.Остатки({(&Дата)}, Партия.Серия = &Серия {(Контрагент = &Контрагент
	               |			    И Склад = &Склад) КАК Поле2}) КАК ТоварыНаКомиссии";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
